tap "buildkite/buildkite"
tap "ddev/ddev"
tap "homebrew/cask-fonts"
tap "puma/puma"

# Utils
brew "antigen"
brew "asdf"
brew "asimov"
brew "bash"
brew "bat"
brew "coreutils"
brew "cowsay"
brew "curl"
brew "dockutil"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-absorb"
brew "git-delta"
brew "git-lfs"
brew "git-town"
brew "gnupg"
brew "mas"
brew "nano"
brew "rcm"
brew "starship"
brew "tealdeer"
brew "telnet"
brew "the_silver_searcher"
brew "watchman"
brew "wget"
brew "xsv"
brew "zoxide"
brew "zsh"

# Languages, Database, etc.
brew "composer"
brew "ddev"
brew "docker"
brew "docker-compose"
brew "httpie"
brew "mailpit"
brew "memcached"
brew "mysql"
brew "nginx"
brew "node-build"
brew "overmind"
brew "pg_partman"
brew "postgresql@14"
brew "puma-dev"
brew "python-build"
brew "redis"
brew "ruby-build"
brew "yarn"

# CLIs
brew "awscli"
brew "flyctl"
brew "gh"
brew "kubernetes-cli"
brew "vercel-cli"

# Buildkite
brew "bik"
brew "bk@3"
brew "buildkite-agent"

# Fonts
cask "font-hack-nerd-font"
cask "font-sf-mono"

# Applications
cask "1password"
cask "1password-cli"
cask "aws-vault"
cask "basecamp"
cask "chatgpt"
cask "chromedriver"
cask "dataspell"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "httpie"
cask "linear-linear"
cask "loom"
cask "notion"
cask "opal-composer"
cask "orbstack"
cask "proxyman"
cask "raycast"
cask "rubymine"
cask "screen-studio"
cask "session-manager-plugin"
cask "slack"
cask "tableplus"
cask "tailscale"
cask "transmission"
cask "vlc"
cask "warp"
cask "whatsapp"
cask "wkhtmltopdf"
cask "zed"
cask "zoom"

# Mac App Store applications
mas "1Password for Safari", id: 1569813296
mas "Bear", id: 1091189122
mas "Instapaper", id: 288545208
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Things", id: 904280696
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
