tap 'homebrew/command-not-found'
tap 'ddev/ddev'

brew 'mas'
brew 'mise'
brew 'rcm'

# Build
brew 'node-build'
brew 'python-build'
brew 'ruby-build'

# Shell
brew 'antidote'
brew 'zsh'

# Utils
brew 'bat'
brew 'coreutils'
brew 'cowsay'
brew 'curl'
brew 'dockutil'
brew 'duf'
brew 'eza'
brew 'ffmpeg'
brew 'fzf'
brew 'gnupg'
brew 'httpie'
brew 'jq'
brew 'nano'
brew 'procs'
brew 'pv'
brew 'qsv'
brew 'tealdeer'
brew 'telnet'
brew 'the_silver_searcher'
brew 'watchman'
brew 'wget'
brew 'zoxide'
brew 'micro'
brew 'yazi'

# Git
brew 'gh'
brew 'git'
brew 'git-absorb'
brew 'git-delta'
brew 'git-lfs'
brew 'git-spice'
brew 'git-town'

# Tools
brew 'awscli'
brew 'composer'
brew 'ddev'
brew 'docker'
brew 'docker-compose'
brew 'flyctl'
brew 'kubernetes-cli'
brew 'localstack'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'overmind'
brew 'php'
brew 'pnpm'
brew 'postgresql'
brew 'redis'
brew 'uv'
brew 'vercel-cli'

# Buildkite
tap 'buildkite/buildkite'
brew 'bik'
brew 'bk@3'
brew 'bktec'
brew 'buildkite-agent'

# Fonts
cask 'font-sf-mono'
cask 'font-sf-compact'
cask 'font-blex-mono-nerd-font'

# Applications
cask '1password'
cask '1password-cli'
cask 'arc'
cask 'aws-vault'
cask 'chatgpt'
cask 'chromedriver'
cask 'claude'
cask 'cleanshot'
cask 'figma'
cask 'httpie'
cask 'linear-linear'
cask 'notion'
cask 'opal-composer'
cask 'orbstack'
cask 'proxyman'
cask 'raycast'
cask 'screen-studio'
cask 'slack'
cask 'tableplus'
cask 'tailscale'
cask 'warp'
cask 'whatsapp'
cask 'wkhtmltopdf'
cask 'zed'
cask 'zoom'

# Mac App Store applications
mas '1Password for Safari', id: 1_569_813_296
mas 'Bear', id: 1_091_189_122
mas 'Instapaper', id: 288_545_208
mas 'Keynote', id: 409_183_694
mas 'Numbers', id: 409_203_825
mas 'Pages', id: 409_201_541
mas 'Pixelmator Pro', id: 1_289_583_905
mas 'Things', id: 904_280_696
mas 'Xcode', id: 497_799_835
